Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_gpio.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     nrf5340_network_gpio equates.
 */

#pragma once

#include    <stdint.h>

// GPIO address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    OUT;
    volatile    uint32_t    OUTSET;
    volatile    uint32_t    OUTCLR;
    volatile    uint32_t    IN;
    volatile    uint32_t    DIR;
    volatile    uint32_t    DIRSET;
    volatile    uint32_t    DIRCLR;
    volatile    uint32_t    LATCH;
    volatile    uint32_t    DETECTMODE;
    volatile    uint32_t    DETECTMODE_SEC;
    volatile    uint32_t    RESERVED1[117];
    volatile    uint32_t    PIN_CNF[32];
} GPIO_TypeDef;

#ifdef __cplusplus
#define P0_NS   reinterpret_cast<GPIO_TypeDef *>(0x418C0500U)
#define P1_NS   reinterpret_cast<GPIO_TypeDef *>(0x418C0800U)

#else
#define P0_NS   ((GPIO_TypeDef *)0x418C0500U)
#define P1_NS   ((GPIO_TypeDef *)0x418C0800U)
#endif

// OUT Configuration

#define GPIO_OUT_PIN31                          (0x1U<<31)
#define GPIO_OUT_PIN30                          (0x1U<<30)
#define GPIO_OUT_PIN29                          (0x1U<<29)
#define GPIO_OUT_PIN28                          (0x1U<<28)
#define GPIO_OUT_PIN27                          (0x1U<<27)
#define GPIO_OUT_PIN26                          (0x1U<<26)
#define GPIO_OUT_PIN25                          (0x1U<<25)
#define GPIO_OUT_PIN24                          (0x1U<<24)
#define GPIO_OUT_PIN23                          (0x1U<<23)
#define GPIO_OUT_PIN22                          (0x1U<<22)
#define GPIO_OUT_PIN21                          (0x1U<<21)
#define GPIO_OUT_PIN20                          (0x1U<<20)
#define GPIO_OUT_PIN19                          (0x1U<<19)
#define GPIO_OUT_PIN18                          (0x1U<<18)
#define GPIO_OUT_PIN17                          (0x1U<<17)
#define GPIO_OUT_PIN16                          (0x1U<<16)
#define GPIO_OUT_PIN15                          (0x1U<<15)
#define GPIO_OUT_PIN14                          (0x1U<<14)
#define GPIO_OUT_PIN13                          (0x1U<<13)
#define GPIO_OUT_PIN12                          (0x1U<<12)
#define GPIO_OUT_PIN11                          (0x1U<<11)
#define GPIO_OUT_PIN10                          (0x1U<<10)
#define GPIO_OUT_PIN9                           (0x1U<<9)
#define GPIO_OUT_PIN8                           (0x1U<<8)
#define GPIO_OUT_PIN7                           (0x1U<<7)
#define GPIO_OUT_PIN6                           (0x1U<<6)
#define GPIO_OUT_PIN5                           (0x1U<<5)
#define GPIO_OUT_PIN4                           (0x1U<<4)
#define GPIO_OUT_PIN3                           (0x1U<<3)
#define GPIO_OUT_PIN2                           (0x1U<<2)
#define GPIO_OUT_PIN1                           (0x1U<<1)
#define GPIO_OUT_PIN0                           (0x1U<<0)
#define GPIO_OUT_PIN31_LOW                      (0x0U<<31)
#define GPIO_OUT_PIN31_HIGH                     (0x1U<<31)
#define GPIO_OUT_PIN30_LOW                      (0x0U<<30)
#define GPIO_OUT_PIN30_HIGH                     (0x1U<<30)
#define GPIO_OUT_PIN29_LOW                      (0x0U<<29)
#define GPIO_OUT_PIN29_HIGH                     (0x1U<<29)
#define GPIO_OUT_PIN28_LOW                      (0x0U<<28)
#define GPIO_OUT_PIN28_HIGH                     (0x1U<<28)
#define GPIO_OUT_PIN27_LOW                      (0x0U<<27)
#define GPIO_OUT_PIN27_HIGH                     (0x1U<<27)
#define GPIO_OUT_PIN26_LOW                      (0x0U<<26)
#define GPIO_OUT_PIN26_HIGH                     (0x1U<<26)
#define GPIO_OUT_PIN25_LOW                      (0x0U<<25)
#define GPIO_OUT_PIN25_HIGH                     (0x1U<<25)
#define GPIO_OUT_PIN24_LOW                      (0x0U<<24)
#define GPIO_OUT_PIN24_HIGH                     (0x1U<<24)
#define GPIO_OUT_PIN23_LOW                      (0x0U<<23)
#define GPIO_OUT_PIN23_HIGH                     (0x1U<<23)
#define GPIO_OUT_PIN22_LOW                      (0x0U<<22)
#define GPIO_OUT_PIN22_HIGH                     (0x1U<<22)
#define GPIO_OUT_PIN21_LOW                      (0x0U<<21)
#define GPIO_OUT_PIN21_HIGH                     (0x1U<<21)
#define GPIO_OUT_PIN20_LOW                      (0x0U<<20)
#define GPIO_OUT_PIN20_HIGH                     (0x1U<<20)
#define GPIO_OUT_PIN19_LOW                      (0x0U<<19)
#define GPIO_OUT_PIN19_HIGH                     (0x1U<<19)
#define GPIO_OUT_PIN18_LOW                      (0x0U<<18)
#define GPIO_OUT_PIN18_HIGH                     (0x1U<<18)
#define GPIO_OUT_PIN17_LOW                      (0x0U<<17)
#define GPIO_OUT_PIN17_HIGH                     (0x1U<<17)
#define GPIO_OUT_PIN16_LOW                      (0x0U<<16)
#define GPIO_OUT_PIN16_HIGH                     (0x1U<<16)
#define GPIO_OUT_PIN15_LOW                      (0x0U<<15)
#define GPIO_OUT_PIN15_HIGH                     (0x1U<<15)
#define GPIO_OUT_PIN14_LOW                      (0x0U<<14)
#define GPIO_OUT_PIN14_HIGH                     (0x1U<<14)
#define GPIO_OUT_PIN13_LOW                      (0x0U<<13)
#define GPIO_OUT_PIN13_HIGH                     (0x1U<<13)
#define GPIO_OUT_PIN12_LOW                      (0x0U<<12)
#define GPIO_OUT_PIN12_HIGH                     (0x1U<<12)
#define GPIO_OUT_PIN11_LOW                      (0x0U<<11)
#define GPIO_OUT_PIN11_HIGH                     (0x1U<<11)
#define GPIO_OUT_PIN10_LOW                      (0x0U<<10)
#define GPIO_OUT_PIN10_HIGH                     (0x1U<<10)
#define GPIO_OUT_PIN9_LOW                       (0x0U<<9)
#define GPIO_OUT_PIN9_HIGH                      (0x1U<<9)
#define GPIO_OUT_PIN8_LOW                       (0x0U<<8)
#define GPIO_OUT_PIN8_HIGH                      (0x1U<<8)
#define GPIO_OUT_PIN7_LOW                       (0x0U<<7)
#define GPIO_OUT_PIN7_HIGH                      (0x1U<<7)
#define GPIO_OUT_PIN6_LOW                       (0x0U<<6)
#define GPIO_OUT_PIN6_HIGH                      (0x1U<<6)
#define GPIO_OUT_PIN5_LOW                       (0x0U<<5)
#define GPIO_OUT_PIN5_HIGH                      (0x1U<<5)
#define GPIO_OUT_PIN4_LOW                       (0x0U<<4)
#define GPIO_OUT_PIN4_HIGH                      (0x1U<<4)
#define GPIO_OUT_PIN3_LOW                       (0x0U<<3)
#define GPIO_OUT_PIN3_HIGH                      (0x1U<<3)
#define GPIO_OUT_PIN2_LOW                       (0x0U<<2)
#define GPIO_OUT_PIN2_HIGH                      (0x1U<<2)
#define GPIO_OUT_PIN1_LOW                       (0x0U<<1)
#define GPIO_OUT_PIN1_HIGH                      (0x1U<<1)
#define GPIO_OUT_PIN0_LOW                       (0x0U<<0)
#define GPIO_OUT_PIN0_HIGH                      (0x1U<<0)

// OUTSET Configuration

