Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_gpio.h
#define GPIO_OUTSET_PIN31                       (0x1U<<31)
#define GPIO_OUTSET_PIN30                       (0x1U<<30)
#define GPIO_OUTSET_PIN29                       (0x1U<<29)
#define GPIO_OUTSET_PIN28                       (0x1U<<28)
#define GPIO_OUTSET_PIN27                       (0x1U<<27)
#define GPIO_OUTSET_PIN26                       (0x1U<<26)
#define GPIO_OUTSET_PIN25                       (0x1U<<25)
#define GPIO_OUTSET_PIN24                       (0x1U<<24)
#define GPIO_OUTSET_PIN23                       (0x1U<<23)
#define GPIO_OUTSET_PIN22                       (0x1U<<22)
#define GPIO_OUTSET_PIN21                       (0x1U<<21)
#define GPIO_OUTSET_PIN20                       (0x1U<<20)
#define GPIO_OUTSET_PIN19                       (0x1U<<19)
#define GPIO_OUTSET_PIN18                       (0x1U<<18)
#define GPIO_OUTSET_PIN17                       (0x1U<<17)
#define GPIO_OUTSET_PIN16                       (0x1U<<16)
#define GPIO_OUTSET_PIN15                       (0x1U<<15)
#define GPIO_OUTSET_PIN14                       (0x1U<<14)
#define GPIO_OUTSET_PIN13                       (0x1U<<13)
#define GPIO_OUTSET_PIN12                       (0x1U<<12)
#define GPIO_OUTSET_PIN11                       (0x1U<<11)
#define GPIO_OUTSET_PIN10                       (0x1U<<10)
#define GPIO_OUTSET_PIN9                        (0x1U<<9)
#define GPIO_OUTSET_PIN8                        (0x1U<<8)
#define GPIO_OUTSET_PIN7                        (0x1U<<7)
#define GPIO_OUTSET_PIN6                        (0x1U<<6)
#define GPIO_OUTSET_PIN5                        (0x1U<<5)
#define GPIO_OUTSET_PIN4                        (0x1U<<4)
#define GPIO_OUTSET_PIN3                        (0x1U<<3)
#define GPIO_OUTSET_PIN2                        (0x1U<<2)
#define GPIO_OUTSET_PIN1                        (0x1U<<1)
#define GPIO_OUTSET_PIN0                        (0x1U<<0)
#define GPIO_OUTSET_PIN31_LOW                   (0x0U<<31)
#define GPIO_OUTSET_PIN31_HIGH                  (0x1U<<31)
#define GPIO_OUTSET_PIN31_SET                   (0x1U<<31)
#define GPIO_OUTSET_PIN30_LOW                   (0x0U<<30)
#define GPIO_OUTSET_PIN30_HIGH                  (0x1U<<30)
#define GPIO_OUTSET_PIN30_SET                   (0x1U<<30)
#define GPIO_OUTSET_PIN29_LOW                   (0x0U<<29)
#define GPIO_OUTSET_PIN29_HIGH                  (0x1U<<29)
#define GPIO_OUTSET_PIN29_SET                   (0x1U<<29)
#define GPIO_OUTSET_PIN28_LOW                   (0x0U<<28)
#define GPIO_OUTSET_PIN28_HIGH                  (0x1U<<28)
#define GPIO_OUTSET_PIN28_SET                   (0x1U<<28)
#define GPIO_OUTSET_PIN27_LOW                   (0x0U<<27)
#define GPIO_OUTSET_PIN27_HIGH                  (0x1U<<27)
#define GPIO_OUTSET_PIN27_SET                   (0x1U<<27)
#define GPIO_OUTSET_PIN26_LOW                   (0x0U<<26)
#define GPIO_OUTSET_PIN26_HIGH                  (0x1U<<26)
#define GPIO_OUTSET_PIN26_SET                   (0x1U<<26)
#define GPIO_OUTSET_PIN25_LOW                   (0x0U<<25)
#define GPIO_OUTSET_PIN25_HIGH                  (0x1U<<25)
#define GPIO_OUTSET_PIN25_SET                   (0x1U<<25)
#define GPIO_OUTSET_PIN24_LOW                   (0x0U<<24)
#define GPIO_OUTSET_PIN24_HIGH                  (0x1U<<24)
#define GPIO_OUTSET_PIN24_SET                   (0x1U<<24)
#define GPIO_OUTSET_PIN23_LOW                   (0x0U<<23)
#define GPIO_OUTSET_PIN23_HIGH                  (0x1U<<23)
#define GPIO_OUTSET_PIN23_SET                   (0x1U<<23)
#define GPIO_OUTSET_PIN22_LOW                   (0x0U<<22)
#define GPIO_OUTSET_PIN22_HIGH                  (0x1U<<22)
#define GPIO_OUTSET_PIN22_SET                   (0x1U<<22)
#define GPIO_OUTSET_PIN21_LOW                   (0x0U<<21)
#define GPIO_OUTSET_PIN21_HIGH                  (0x1U<<21)
#define GPIO_OUTSET_PIN21_SET                   (0x1U<<21)
#define GPIO_OUTSET_PIN20_LOW                   (0x0U<<20)
#define GPIO_OUTSET_PIN20_HIGH                  (0x1U<<20)
#define GPIO_OUTSET_PIN20_SET                   (0x1U<<20)
#define GPIO_OUTSET_PIN19_LOW                   (0x0U<<19)
#define GPIO_OUTSET_PIN19_HIGH                  (0x1U<<19)
#define GPIO_OUTSET_PIN19_SET                   (0x1U<<19)
#define GPIO_OUTSET_PIN18_LOW                   (0x0U<<18)
#define GPIO_OUTSET_PIN18_HIGH                  (0x1U<<18)
#define GPIO_OUTSET_PIN18_SET                   (0x1U<<18)
#define GPIO_OUTSET_PIN17_LOW                   (0x0U<<17)
#define GPIO_OUTSET_PIN17_HIGH                  (0x1U<<17)
#define GPIO_OUTSET_PIN17_SET                   (0x1U<<17)
#define GPIO_OUTSET_PIN16_LOW                   (0x0U<<16)
#define GPIO_OUTSET_PIN16_HIGH                  (0x1U<<16)
#define GPIO_OUTSET_PIN16_SET                   (0x1U<<16)
#define GPIO_OUTSET_PIN15_LOW                   (0x0U<<15)
#define GPIO_OUTSET_PIN15_HIGH                  (0x1U<<15)
#define GPIO_OUTSET_PIN15_SET                   (0x1U<<15)
#define GPIO_OUTSET_PIN14_LOW                   (0x0U<<14)
#define GPIO_OUTSET_PIN14_HIGH                  (0x1U<<14)
#define GPIO_OUTSET_PIN14_SET                   (0x1U<<14)
#define GPIO_OUTSET_PIN13_LOW                   (0x0U<<13)
#define GPIO_OUTSET_PIN13_HIGH                  (0x1U<<13)
#define GPIO_OUTSET_PIN13_SET                   (0x1U<<13)
#define GPIO_OUTSET_PIN12_LOW                   (0x0U<<12)
#define GPIO_OUTSET_PIN12_HIGH                  (0x1U<<12)
#define GPIO_OUTSET_PIN12_SET                   (0x1U<<12)
#define GPIO_OUTSET_PIN11_LOW                   (0x0U<<11)
#define GPIO_OUTSET_PIN11_HIGH                  (0x1U<<11)
#define GPIO_OUTSET_PIN11_SET                   (0x1U<<11)
#define GPIO_OUTSET_PIN10_LOW                   (0x0U<<10)
#define GPIO_OUTSET_PIN10_HIGH                  (0x1U<<10)
#define GPIO_OUTSET_PIN10_SET                   (0x1U<<10)
#define GPIO_OUTSET_PIN9_LOW                    (0x0U<<9)
#define GPIO_OUTSET_PIN9_HIGH                   (0x1U<<9)
#define GPIO_OUTSET_PIN9_SET                    (0x1U<<9)
#define GPIO_OUTSET_PIN8_LOW                    (0x0U<<8)
#define GPIO_OUTSET_PIN8_HIGH                   (0x1U<<8)
#define GPIO_OUTSET_PIN8_SET                    (0x1U<<8)
#define GPIO_OUTSET_PIN7_LOW                    (0x0U<<7)
#define GPIO_OUTSET_PIN7_HIGH                   (0x1U<<7)
#define GPIO_OUTSET_PIN7_SET                    (0x1U<<7)
#define GPIO_OUTSET_PIN6_LOW                    (0x0U<<6)
#define GPIO_OUTSET_PIN6_HIGH                   (0x1U<<6)
#define GPIO_OUTSET_PIN6_SET                    (0x1U<<6)
#define GPIO_OUTSET_PIN5_LOW                    (0x0U<<5)
#define GPIO_OUTSET_PIN5_HIGH                   (0x1U<<5)
#define GPIO_OUTSET_PIN5_SET                    (0x1U<<5)
#define GPIO_OUTSET_PIN4_LOW                    (0x0U<<4)
#define GPIO_OUTSET_PIN4_HIGH                   (0x1U<<4)
#define GPIO_OUTSET_PIN4_SET                    (0x1U<<4)
#define GPIO_OUTSET_PIN3_LOW                    (0x0U<<3)
#define GPIO_OUTSET_PIN3_HIGH                   (0x1U<<3)
#define GPIO_OUTSET_PIN3_SET                    (0x1U<<3)
#define GPIO_OUTSET_PIN2_LOW                    (0x0U<<2)
#define GPIO_OUTSET_PIN2_HIGH                   (0x1U<<2)
#define GPIO_OUTSET_PIN2_SET                    (0x1U<<2)
#define GPIO_OUTSET_PIN1_LOW                    (0x0U<<1)
#define GPIO_OUTSET_PIN1_HIGH                   (0x1U<<1)
#define GPIO_OUTSET_PIN1_SET                    (0x1U<<1)
#define GPIO_OUTSET_PIN0_LOW                    (0x0U<<0)
#define GPIO_OUTSET_PIN0_HIGH                   (0x1U<<0)
#define GPIO_OUTSET_PIN0_SET                    (0x1U<<0)

// OUTCLR Configuration

#define GPIO_OUTCLR_PIN31                       (0x1U<<31)
#define GPIO_OUTCLR_PIN30                       (0x1U<<30)
#define GPIO_OUTCLR_PIN29                       (0x1U<<29)
#define GPIO_OUTCLR_PIN28                       (0x1U<<28)
#define GPIO_OUTCLR_PIN27                       (0x1U<<27)
#define GPIO_OUTCLR_PIN26                       (0x1U<<26)
#define GPIO_OUTCLR_PIN25                       (0x1U<<25)
#define GPIO_OUTCLR_PIN24                       (0x1U<<24)
#define GPIO_OUTCLR_PIN23                       (0x1U<<23)
#define GPIO_OUTCLR_PIN22                       (0x1U<<22)
#define GPIO_OUTCLR_PIN21                       (0x1U<<21)
#define GPIO_OUTCLR_PIN20                       (0x1U<<20)
#define GPIO_OUTCLR_PIN19                       (0x1U<<19)
#define GPIO_OUTCLR_PIN18                       (0x1U<<18)
#define GPIO_OUTCLR_PIN17                       (0x1U<<17)
#define GPIO_OUTCLR_PIN16                       (0x1U<<16)
#define GPIO_OUTCLR_PIN15                       (0x1U<<15)
#define GPIO_OUTCLR_PIN14                       (0x1U<<14)
#define GPIO_OUTCLR_PIN13                       (0x1U<<13)
#define GPIO_OUTCLR_PIN12                       (0x1U<<12)
#define GPIO_OUTCLR_PIN11                       (0x1U<<11)
#define GPIO_OUTCLR_PIN10                       (0x1U<<10)
#define GPIO_OUTCLR_PIN9                        (0x1U<<9)
#define GPIO_OUTCLR_PIN8                        (0x1U<<8)
#define GPIO_OUTCLR_PIN7                        (0x1U<<7)
#define GPIO_OUTCLR_PIN6                        (0x1U<<6)
#define GPIO_OUTCLR_PIN5                        (0x1U<<5)
#define GPIO_OUTCLR_PIN4                        (0x1U<<4)
#define GPIO_OUTCLR_PIN3                        (0x1U<<3)
#define GPIO_OUTCLR_PIN2                        (0x1U<<2)
#define GPIO_OUTCLR_PIN1                        (0x1U<<1)
#define GPIO_OUTCLR_PIN0                        (0x1U<<0)
#define GPIO_OUTCLR_PIN31_LOW                   (0x0U<<31)
#define GPIO_OUTCLR_PIN31_HIGH                  (0x1U<<31)
#define GPIO_OUTCLR_PIN31_CLEAR                 (0x1U<<31)
#define GPIO_OUTCLR_PIN30_LOW                   (0x0U<<30)
#define GPIO_OUTCLR_PIN30_HIGH                  (0x1U<<30)
#define GPIO_OUTCLR_PIN30_CLEAR                 (0x1U<<30)
#define GPIO_OUTCLR_PIN29_LOW                   (0x0U<<29)
#define GPIO_OUTCLR_PIN29_HIGH                  (0x1U<<29)
#define GPIO_OUTCLR_PIN29_CLEAR                 (0x1U<<29)
#define GPIO_OUTCLR_PIN28_LOW                   (0x0U<<28)
#define GPIO_OUTCLR_PIN28_HIGH                  (0x1U<<28)
#define GPIO_OUTCLR_PIN28_CLEAR                 (0x1U<<28)
#define GPIO_OUTCLR_PIN27_LOW                   (0x0U<<27)
#define GPIO_OUTCLR_PIN27_HIGH                  (0x1U<<27)
#define GPIO_OUTCLR_PIN27_CLEAR                 (0x1U<<27)
#define GPIO_OUTCLR_PIN26_LOW                   (0x0U<<26)
#define GPIO_OUTCLR_PIN26_HIGH                  (0x1U<<26)
#define GPIO_OUTCLR_PIN26_CLEAR                 (0x1U<<26)
#define GPIO_OUTCLR_PIN25_LOW                   (0x0U<<25)
#define GPIO_OUTCLR_PIN25_HIGH                  (0x1U<<25)
#define GPIO_OUTCLR_PIN25_CLEAR                 (0x1U<<25)
#define GPIO_OUTCLR_PIN24_LOW                   (0x0U<<24)
#define GPIO_OUTCLR_PIN24_HIGH                  (0x1U<<24)
#define GPIO_OUTCLR_PIN24_CLEAR                 (0x1U<<24)
#define GPIO_OUTCLR_PIN23_LOW                   (0x0U<<23)
#define GPIO_OUTCLR_PIN23_HIGH                  (0x1U<<23)
#define GPIO_OUTCLR_PIN23_CLEAR                 (0x1U<<23)
#define GPIO_OUTCLR_PIN22_LOW                   (0x0U<<22)
#define GPIO_OUTCLR_PIN22_HIGH                  (0x1U<<22)
#define GPIO_OUTCLR_PIN22_CLEAR                 (0x1U<<22)
#define GPIO_OUTCLR_PIN21_LOW                   (0x0U<<21)
#define GPIO_OUTCLR_PIN21_HIGH                  (0x1U<<21)
#define GPIO_OUTCLR_PIN21_CLEAR                 (0x1U<<21)
#define GPIO_OUTCLR_PIN20_LOW                   (0x0U<<20)
#define GPIO_OUTCLR_PIN20_HIGH                  (0x1U<<20)
#define GPIO_OUTCLR_PIN20_CLEAR                 (0x1U<<20)
#define GPIO_OUTCLR_PIN19_LOW                   (0x0U<<19)
#define GPIO_OUTCLR_PIN19_HIGH                  (0x1U<<19)
#define GPIO_OUTCLR_PIN19_CLEAR                 (0x1U<<19)
#define GPIO_OUTCLR_PIN18_LOW                   (0x0U<<18)
#define GPIO_OUTCLR_PIN18_HIGH                  (0x1U<<18)
#define GPIO_OUTCLR_PIN18_CLEAR                 (0x1U<<18)
#define GPIO_OUTCLR_PIN17_LOW                   (0x0U<<17)
#define GPIO_OUTCLR_PIN17_HIGH                  (0x1U<<17)
#define GPIO_OUTCLR_PIN17_CLEAR                 (0x1U<<17)
#define GPIO_OUTCLR_PIN16_LOW                   (0x0U<<16)
#define GPIO_OUTCLR_PIN16_HIGH                  (0x1U<<16)
#define GPIO_OUTCLR_PIN16_CLEAR                 (0x1U<<16)
#define GPIO_OUTCLR_PIN15_LOW                   (0x0U<<15)
#define GPIO_OUTCLR_PIN15_HIGH                  (0x1U<<15)
#define GPIO_OUTCLR_PIN15_CLEAR                 (0x1U<<15)
#define GPIO_OUTCLR_PIN14_LOW                   (0x0U<<14)
#define GPIO_OUTCLR_PIN14_HIGH                  (0x1U<<14)
#define GPIO_OUTCLR_PIN14_CLEAR                 (0x1U<<14)
#define GPIO_OUTCLR_PIN13_LOW                   (0x0U<<13)
#define GPIO_OUTCLR_PIN13_HIGH                  (0x1U<<13)
#define GPIO_OUTCLR_PIN13_CLEAR                 (0x1U<<13)
#define GPIO_OUTCLR_PIN12_LOW                   (0x0U<<12)
#define GPIO_OUTCLR_PIN12_HIGH                  (0x1U<<12)
#define GPIO_OUTCLR_PIN12_CLEAR                 (0x1U<<12)
#define GPIO_OUTCLR_PIN11_LOW                   (0x0U<<11)
#define GPIO_OUTCLR_PIN11_HIGH                  (0x1U<<11)
#define GPIO_OUTCLR_PIN11_CLEAR                 (0x1U<<11)
#define GPIO_OUTCLR_PIN10_LOW                   (0x0U<<10)
#define GPIO_OUTCLR_PIN10_HIGH                  (0x1U<<10)
#define GPIO_OUTCLR_PIN10_CLEAR                 (0x1U<<10)
#define GPIO_OUTCLR_PIN9_LOW                    (0x0U<<9)
#define GPIO_OUTCLR_PIN9_HIGH                   (0x1U<<9)
#define GPIO_OUTCLR_PIN9_CLEAR                  (0x1U<<9)
#define GPIO_OUTCLR_PIN8_LOW                    (0x0U<<8)
#define GPIO_OUTCLR_PIN8_HIGH                   (0x1U<<8)
#define GPIO_OUTCLR_PIN8_CLEAR                  (0x1U<<8)
#define GPIO_OUTCLR_PIN7_LOW                    (0x0U<<7)
#define GPIO_OUTCLR_PIN7_HIGH                   (0x1U<<7)
#define GPIO_OUTCLR_PIN7_CLEAR                  (0x1U<<7)
#define GPIO_OUTCLR_PIN6_LOW                    (0x0U<<6)
#define GPIO_OUTCLR_PIN6_HIGH                   (0x1U<<6)
#define GPIO_OUTCLR_PIN6_CLEAR                  (0x1U<<6)
#define GPIO_OUTCLR_PIN5_LOW                    (0x0U<<5)
#define GPIO_OUTCLR_PIN5_HIGH                   (0x1U<<5)
#define GPIO_OUTCLR_PIN5_CLEAR                  (0x1U<<5)
#define GPIO_OUTCLR_PIN4_LOW                    (0x0U<<4)
#define GPIO_OUTCLR_PIN4_HIGH                   (0x1U<<4)
#define GPIO_OUTCLR_PIN4_CLEAR                  (0x1U<<4)
#define GPIO_OUTCLR_PIN3_LOW                    (0x0U<<3)
#define GPIO_OUTCLR_PIN3_HIGH                   (0x1U<<3)
#define GPIO_OUTCLR_PIN3_CLEAR                  (0x1U<<3)
#define GPIO_OUTCLR_PIN2_LOW                    (0x0U<<2)
#define GPIO_OUTCLR_PIN2_HIGH                   (0x1U<<2)
#define GPIO_OUTCLR_PIN2_CLEAR                  (0x1U<<2)
#define GPIO_OUTCLR_PIN1_LOW                    (0x0U<<1)
#define GPIO_OUTCLR_PIN1_HIGH                   (0x1U<<1)
#define GPIO_OUTCLR_PIN1_CLEAR                  (0x1U<<1)
#define GPIO_OUTCLR_PIN0_LOW                    (0x0U<<0)
#define GPIO_OUTCLR_PIN0_HIGH                   (0x1U<<0)
#define GPIO_OUTCLR_PIN0_CLEAR                  (0x1U<<0)

// IN Configuration

#define GPIO_IN_PIN31                           (0x1U<<31)
#define GPIO_IN_PIN30                           (0x1U<<30)
#define GPIO_IN_PIN29                           (0x1U<<29)
#define GPIO_IN_PIN28                           (0x1U<<28)
#define GPIO_IN_PIN27                           (0x1U<<27)
#define GPIO_IN_PIN26                           (0x1U<<26)
#define GPIO_IN_PIN25                           (0x1U<<25)
#define GPIO_IN_PIN24                           (0x1U<<24)
#define GPIO_IN_PIN23                           (0x1U<<23)
#define GPIO_IN_PIN22                           (0x1U<<22)
#define GPIO_IN_PIN21                           (0x1U<<21)
#define GPIO_IN_PIN20                           (0x1U<<20)
#define GPIO_IN_PIN19                           (0x1U<<19)
#define GPIO_IN_PIN18                           (0x1U<<18)
#define GPIO_IN_PIN17                           (0x1U<<17)
#define GPIO_IN_PIN16                           (0x1U<<16)
#define GPIO_IN_PIN15                           (0x1U<<15)
#define GPIO_IN_PIN14                           (0x1U<<14)
#define GPIO_IN_PIN13                           (0x1U<<13)
#define GPIO_IN_PIN12                           (0x1U<<12)
#define GPIO_IN_PIN11                           (0x1U<<11)
#define GPIO_IN_PIN10                           (0x1U<<10)
#define GPIO_IN_PIN9                            (0x1U<<9)
#define GPIO_IN_PIN8                            (0x1U<<8)
#define GPIO_IN_PIN7                            (0x1U<<7)
#define GPIO_IN_PIN6                            (0x1U<<6)
#define GPIO_IN_PIN5                            (0x1U<<5)
#define GPIO_IN_PIN4                            (0x1U<<4)
#define GPIO_IN_PIN3                            (0x1U<<3)
#define GPIO_IN_PIN2                            (0x1U<<2)
#define GPIO_IN_PIN1                            (0x1U<<1)
#define GPIO_IN_PIN0                            (0x1U<<0)
#define GPIO_IN_PIN31_LOW                       (0x0U<<31)
#define GPIO_IN_PIN31_HIGH                      (0x1U<<31)
#define GPIO_IN_PIN30_LOW                       (0x0U<<30)
#define GPIO_IN_PIN30_HIGH                      (0x1U<<30)
#define GPIO_IN_PIN29_LOW                       (0x0U<<29)
#define GPIO_IN_PIN29_HIGH                      (0x1U<<29)
#define GPIO_IN_PIN28_LOW                       (0x0U<<28)
#define GPIO_IN_PIN28_HIGH                      (0x1U<<28)
#define GPIO_IN_PIN27_LOW                       (0x0U<<27)
#define GPIO_IN_PIN27_HIGH                      (0x1U<<27)
#define GPIO_IN_PIN26_LOW                       (0x0U<<26)
#define GPIO_IN_PIN26_HIGH                      (0x1U<<26)
#define GPIO_IN_PIN25_LOW                       (0x0U<<25)
#define GPIO_IN_PIN25_HIGH                      (0x1U<<25)
#define GPIO_IN_PIN24_LOW                       (0x0U<<24)
#define GPIO_IN_PIN24_HIGH                      (0x1U<<24)
#define GPIO_IN_PIN23_LOW                       (0x0U<<23)
#define GPIO_IN_PIN23_HIGH                      (0x1U<<23)
#define GPIO_IN_PIN22_LOW                       (0x0U<<22)
#define GPIO_IN_PIN22_HIGH                      (0x1U<<22)
#define GPIO_IN_PIN21_LOW                       (0x0U<<21)
#define GPIO_IN_PIN21_HIGH                      (0x1U<<21)
#define GPIO_IN_PIN20_LOW                       (0x0U<<20)
#define GPIO_IN_PIN20_HIGH                      (0x1U<<20)
#define GPIO_IN_PIN19_LOW                       (0x0U<<19)
#define GPIO_IN_PIN19_HIGH                      (0x1U<<19)
#define GPIO_IN_PIN18_LOW                       (0x0U<<18)
#define GPIO_IN_PIN18_HIGH                      (0x1U<<18)
#define GPIO_IN_PIN17_LOW                       (0x0U<<17)
#define GPIO_IN_PIN17_HIGH                      (0x1U<<17)
#define GPIO_IN_PIN16_LOW                       (0x0U<<16)
#define GPIO_IN_PIN16_HIGH                      (0x1U<<16)
#define GPIO_IN_PIN15_LOW                       (0x0U<<15)
#define GPIO_IN_PIN15_HIGH                      (0x1U<<15)
#define GPIO_IN_PIN14_LOW                       (0x0U<<14)
#define GPIO_IN_PIN14_HIGH                      (0x1U<<14)
#define GPIO_IN_PIN13_LOW                       (0x0U<<13)
#define GPIO_IN_PIN13_HIGH                      (0x1U<<13)
#define GPIO_IN_PIN12_LOW                       (0x0U<<12)
#define GPIO_IN_PIN12_HIGH                      (0x1U<<12)
#define GPIO_IN_PIN11_LOW                       (0x0U<<11)
#define GPIO_IN_PIN11_HIGH                      (0x1U<<11)
#define GPIO_IN_PIN10_LOW                       (0x0U<<10)
#define GPIO_IN_PIN10_HIGH                      (0x1U<<10)
#define GPIO_IN_PIN9_LOW                        (0x0U<<9)
#define GPIO_IN_PIN9_HIGH                       (0x1U<<9)
#define GPIO_IN_PIN8_LOW                        (0x0U<<8)
#define GPIO_IN_PIN8_HIGH                       (0x1U<<8)
#define GPIO_IN_PIN7_LOW                        (0x0U<<7)
#define GPIO_IN_PIN7_HIGH                       (0x1U<<7)
#define GPIO_IN_PIN6_LOW                        (0x0U<<6)
#define GPIO_IN_PIN6_HIGH                       (0x1U<<6)
#define GPIO_IN_PIN5_LOW                        (0x0U<<5)
#define GPIO_IN_PIN5_HIGH                       (0x1U<<5)
#define GPIO_IN_PIN4_LOW                        (0x0U<<4)
#define GPIO_IN_PIN4_HIGH                       (0x1U<<4)
#define GPIO_IN_PIN3_LOW                        (0x0U<<3)
#define GPIO_IN_PIN3_HIGH                       (0x1U<<3)
#define GPIO_IN_PIN2_LOW                        (0x0U<<2)
#define GPIO_IN_PIN2_HIGH                       (0x1U<<2)
#define GPIO_IN_PIN1_LOW                        (0x0U<<1)
#define GPIO_IN_PIN1_HIGH                       (0x1U<<1)
#define GPIO_IN_PIN0_LOW                        (0x0U<<0)
#define GPIO_IN_PIN0_HIGH                       (0x1U<<0)

// DIR Configuration

