Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_gpio.h
#define GPIO_DIR_PIN31                          (0x1U<<31)
#define GPIO_DIR_PIN30                          (0x1U<<30)
#define GPIO_DIR_PIN29                          (0x1U<<29)
#define GPIO_DIR_PIN28                          (0x1U<<28)
#define GPIO_DIR_PIN27                          (0x1U<<27)
#define GPIO_DIR_PIN26                          (0x1U<<26)
#define GPIO_DIR_PIN25                          (0x1U<<25)
#define GPIO_DIR_PIN24                          (0x1U<<24)
#define GPIO_DIR_PIN23                          (0x1U<<23)
#define GPIO_DIR_PIN22                          (0x1U<<22)
#define GPIO_DIR_PIN21                          (0x1U<<21)
#define GPIO_DIR_PIN20                          (0x1U<<20)
#define GPIO_DIR_PIN19                          (0x1U<<19)
#define GPIO_DIR_PIN18                          (0x1U<<18)
#define GPIO_DIR_PIN17                          (0x1U<<17)
#define GPIO_DIR_PIN16                          (0x1U<<16)
#define GPIO_DIR_PIN15                          (0x1U<<15)
#define GPIO_DIR_PIN14                          (0x1U<<14)
#define GPIO_DIR_PIN13                          (0x1U<<13)
#define GPIO_DIR_PIN12                          (0x1U<<12)
#define GPIO_DIR_PIN11                          (0x1U<<11)
#define GPIO_DIR_PIN10                          (0x1U<<10)
#define GPIO_DIR_PIN9                           (0x1U<<9)
#define GPIO_DIR_PIN8                           (0x1U<<8)
#define GPIO_DIR_PIN7                           (0x1U<<7)
#define GPIO_DIR_PIN6                           (0x1U<<6)
#define GPIO_DIR_PIN5                           (0x1U<<5)
#define GPIO_DIR_PIN4                           (0x1U<<4)
#define GPIO_DIR_PIN3                           (0x1U<<3)
#define GPIO_DIR_PIN2                           (0x1U<<2)
#define GPIO_DIR_PIN1                           (0x1U<<1)
#define GPIO_DIR_PIN0                           (0x1U<<0)
#define GPIO_DIR_PIN31_INPUT                    (0x0U<<31)
#define GPIO_DIR_PIN31_OUTPUT                   (0x1U<<31)
#define GPIO_DIR_PIN30_INPUT                    (0x0U<<30)
#define GPIO_DIR_PIN30_OUTPUT                   (0x1U<<30)
#define GPIO_DIR_PIN29_INPUT                    (0x0U<<29)
#define GPIO_DIR_PIN29_OUTPUT                   (0x1U<<29)
#define GPIO_DIR_PIN28_INPUT                    (0x0U<<28)
#define GPIO_DIR_PIN28_OUTPUT                   (0x1U<<28)
#define GPIO_DIR_PIN27_INPUT                    (0x0U<<27)
#define GPIO_DIR_PIN27_OUTPUT                   (0x1U<<27)
#define GPIO_DIR_PIN26_INPUT                    (0x0U<<26)
#define GPIO_DIR_PIN26_OUTPUT                   (0x1U<<26)
#define GPIO_DIR_PIN25_INPUT                    (0x0U<<25)
#define GPIO_DIR_PIN25_OUTPUT                   (0x1U<<25)
#define GPIO_DIR_PIN24_INPUT                    (0x0U<<24)
#define GPIO_DIR_PIN24_OUTPUT                   (0x1U<<24)
#define GPIO_DIR_PIN23_INPUT                    (0x0U<<23)
#define GPIO_DIR_PIN23_OUTPUT                   (0x1U<<23)
#define GPIO_DIR_PIN22_INPUT                    (0x0U<<22)
#define GPIO_DIR_PIN22_OUTPUT                   (0x1U<<22)
#define GPIO_DIR_PIN21_INPUT                    (0x0U<<21)
#define GPIO_DIR_PIN21_OUTPUT                   (0x1U<<21)
#define GPIO_DIR_PIN20_INPUT                    (0x0U<<20)
#define GPIO_DIR_PIN20_OUTPUT                   (0x1U<<20)
#define GPIO_DIR_PIN19_INPUT                    (0x0U<<19)
#define GPIO_DIR_PIN19_OUTPUT                   (0x1U<<19)
#define GPIO_DIR_PIN18_INPUT                    (0x0U<<18)
#define GPIO_DIR_PIN18_OUTPUT                   (0x1U<<18)
#define GPIO_DIR_PIN17_INPUT                    (0x0U<<17)
#define GPIO_DIR_PIN17_OUTPUT                   (0x1U<<17)
#define GPIO_DIR_PIN16_INPUT                    (0x0U<<16)
#define GPIO_DIR_PIN16_OUTPUT                   (0x1U<<16)
#define GPIO_DIR_PIN15_INPUT                    (0x0U<<15)
#define GPIO_DIR_PIN15_OUTPUT                   (0x1U<<15)
#define GPIO_DIR_PIN14_INPUT                    (0x0U<<14)
#define GPIO_DIR_PIN14_OUTPUT                   (0x1U<<14)
#define GPIO_DIR_PIN13_INPUT                    (0x0U<<13)
#define GPIO_DIR_PIN13_OUTPUT                   (0x1U<<13)
#define GPIO_DIR_PIN12_INPUT                    (0x0U<<12)
#define GPIO_DIR_PIN12_OUTPUT                   (0x1U<<12)
#define GPIO_DIR_PIN11_INPUT                    (0x0U<<11)
#define GPIO_DIR_PIN11_OUTPUT                   (0x1U<<11)
#define GPIO_DIR_PIN10_INPUT                    (0x0U<<10)
#define GPIO_DIR_PIN10_OUTPUT                   (0x1U<<10)
#define GPIO_DIR_PIN9_INPUT                     (0x0U<<9)
#define GPIO_DIR_PIN9_OUTPUT                    (0x1U<<9)
#define GPIO_DIR_PIN8_INPUT                     (0x0U<<8)
#define GPIO_DIR_PIN8_OUTPUT                    (0x1U<<8)
#define GPIO_DIR_PIN7_INPUT                     (0x0U<<7)
#define GPIO_DIR_PIN7_OUTPUT                    (0x1U<<7)
#define GPIO_DIR_PIN6_INPUT                     (0x0U<<6)
#define GPIO_DIR_PIN6_OUTPUT                    (0x1U<<6)
#define GPIO_DIR_PIN5_INPUT                     (0x0U<<5)
#define GPIO_DIR_PIN5_OUTPUT                    (0x1U<<5)
#define GPIO_DIR_PIN4_INPUT                     (0x0U<<4)
#define GPIO_DIR_PIN4_OUTPUT                    (0x1U<<4)
#define GPIO_DIR_PIN3_INPUT                     (0x0U<<3)
#define GPIO_DIR_PIN3_OUTPUT                    (0x1U<<3)
#define GPIO_DIR_PIN2_INPUT                     (0x0U<<2)
#define GPIO_DIR_PIN2_OUTPUT                    (0x1U<<2)
#define GPIO_DIR_PIN1_INPUT                     (0x0U<<1)
#define GPIO_DIR_PIN1_OUTPUT                    (0x1U<<1)
#define GPIO_DIR_PIN0_INPUT                     (0x0U<<0)
#define GPIO_DIR_PIN0_OUTPUT                    (0x1U<<0)

// DIRSET Configuration

#define GPIO_DIRSET_PIN31                       (0x1U<<31)
#define GPIO_DIRSET_PIN30                       (0x1U<<30)
#define GPIO_DIRSET_PIN29                       (0x1U<<29)
#define GPIO_DIRSET_PIN28                       (0x1U<<28)
#define GPIO_DIRSET_PIN27                       (0x1U<<27)
#define GPIO_DIRSET_PIN26                       (0x1U<<26)
#define GPIO_DIRSET_PIN25                       (0x1U<<25)
#define GPIO_DIRSET_PIN24                       (0x1U<<24)
#define GPIO_DIRSET_PIN23                       (0x1U<<23)
#define GPIO_DIRSET_PIN22                       (0x1U<<22)
#define GPIO_DIRSET_PIN21                       (0x1U<<21)
#define GPIO_DIRSET_PIN20                       (0x1U<<20)
#define GPIO_DIRSET_PIN19                       (0x1U<<19)
#define GPIO_DIRSET_PIN18                       (0x1U<<18)
#define GPIO_DIRSET_PIN17                       (0x1U<<17)
#define GPIO_DIRSET_PIN16                       (0x1U<<16)
#define GPIO_DIRSET_PIN15                       (0x1U<<15)
#define GPIO_DIRSET_PIN14                       (0x1U<<14)
#define GPIO_DIRSET_PIN13                       (0x1U<<13)
#define GPIO_DIRSET_PIN12                       (0x1U<<12)
#define GPIO_DIRSET_PIN11                       (0x1U<<11)
#define GPIO_DIRSET_PIN10                       (0x1U<<10)
#define GPIO_DIRSET_PIN9                        (0x1U<<9)
#define GPIO_DIRSET_PIN8                        (0x1U<<8)
#define GPIO_DIRSET_PIN7                        (0x1U<<7)
#define GPIO_DIRSET_PIN6                        (0x1U<<6)
#define GPIO_DIRSET_PIN5                        (0x1U<<5)
#define GPIO_DIRSET_PIN4                        (0x1U<<4)
#define GPIO_DIRSET_PIN3                        (0x1U<<3)
#define GPIO_DIRSET_PIN2                        (0x1U<<2)
#define GPIO_DIRSET_PIN1                        (0x1U<<1)
#define GPIO_DIRSET_PIN0                        (0x1U<<0)
#define GPIO_DIRSET_PIN31_INPUT                 (0x0U<<31)
#define GPIO_DIRSET_PIN31_OUTPUT                (0x1U<<31)
#define GPIO_DIRSET_PIN31_SET                   (0x1U<<31)
#define GPIO_DIRSET_PIN30_INPUT                 (0x0U<<30)
#define GPIO_DIRSET_PIN30_OUTPUT                (0x1U<<30)
#define GPIO_DIRSET_PIN30_SET                   (0x1U<<30)
#define GPIO_DIRSET_PIN29_INPUT                 (0x0U<<29)
#define GPIO_DIRSET_PIN29_OUTPUT                (0x1U<<29)
#define GPIO_DIRSET_PIN29_SET                   (0x1U<<29)
#define GPIO_DIRSET_PIN28_INPUT                 (0x0U<<28)
#define GPIO_DIRSET_PIN28_OUTPUT                (0x1U<<28)
#define GPIO_DIRSET_PIN28_SET                   (0x1U<<28)
#define GPIO_DIRSET_PIN27_INPUT                 (0x0U<<27)
#define GPIO_DIRSET_PIN27_OUTPUT                (0x1U<<27)
#define GPIO_DIRSET_PIN27_SET                   (0x1U<<27)
#define GPIO_DIRSET_PIN26_INPUT                 (0x0U<<26)
#define GPIO_DIRSET_PIN26_OUTPUT                (0x1U<<26)
#define GPIO_DIRSET_PIN26_SET                   (0x1U<<26)
#define GPIO_DIRSET_PIN25_INPUT                 (0x0U<<25)
#define GPIO_DIRSET_PIN25_OUTPUT                (0x1U<<25)
#define GPIO_DIRSET_PIN25_SET                   (0x1U<<25)
#define GPIO_DIRSET_PIN24_INPUT                 (0x0U<<24)
#define GPIO_DIRSET_PIN24_OUTPUT                (0x1U<<24)
#define GPIO_DIRSET_PIN24_SET                   (0x1U<<24)
#define GPIO_DIRSET_PIN23_INPUT                 (0x0U<<23)
#define GPIO_DIRSET_PIN23_OUTPUT                (0x1U<<23)
#define GPIO_DIRSET_PIN23_SET                   (0x1U<<23)
#define GPIO_DIRSET_PIN22_INPUT                 (0x0U<<22)
#define GPIO_DIRSET_PIN22_OUTPUT                (0x1U<<22)
#define GPIO_DIRSET_PIN22_SET                   (0x1U<<22)
#define GPIO_DIRSET_PIN21_INPUT                 (0x0U<<21)
#define GPIO_DIRSET_PIN21_OUTPUT                (0x1U<<21)
#define GPIO_DIRSET_PIN21_SET                   (0x1U<<21)
#define GPIO_DIRSET_PIN20_INPUT                 (0x0U<<20)
#define GPIO_DIRSET_PIN20_OUTPUT                (0x1U<<20)
#define GPIO_DIRSET_PIN20_SET                   (0x1U<<20)
#define GPIO_DIRSET_PIN19_INPUT                 (0x0U<<19)
#define GPIO_DIRSET_PIN19_OUTPUT                (0x1U<<19)
#define GPIO_DIRSET_PIN19_SET                   (0x1U<<19)
#define GPIO_DIRSET_PIN18_INPUT                 (0x0U<<18)
#define GPIO_DIRSET_PIN18_OUTPUT                (0x1U<<18)
#define GPIO_DIRSET_PIN18_SET                   (0x1U<<18)
#define GPIO_DIRSET_PIN17_INPUT                 (0x0U<<17)
#define GPIO_DIRSET_PIN17_OUTPUT                (0x1U<<17)
#define GPIO_DIRSET_PIN17_SET                   (0x1U<<17)
#define GPIO_DIRSET_PIN16_INPUT                 (0x0U<<16)
#define GPIO_DIRSET_PIN16_OUTPUT                (0x1U<<16)
#define GPIO_DIRSET_PIN16_SET                   (0x1U<<16)
#define GPIO_DIRSET_PIN15_INPUT                 (0x0U<<15)
#define GPIO_DIRSET_PIN15_OUTPUT                (0x1U<<15)
#define GPIO_DIRSET_PIN15_SET                   (0x1U<<15)
#define GPIO_DIRSET_PIN14_INPUT                 (0x0U<<14)
#define GPIO_DIRSET_PIN14_OUTPUT                (0x1U<<14)
#define GPIO_DIRSET_PIN14_SET                   (0x1U<<14)
#define GPIO_DIRSET_PIN13_INPUT                 (0x0U<<13)
#define GPIO_DIRSET_PIN13_OUTPUT                (0x1U<<13)
#define GPIO_DIRSET_PIN13_SET                   (0x1U<<13)
#define GPIO_DIRSET_PIN12_INPUT                 (0x0U<<12)
#define GPIO_DIRSET_PIN12_OUTPUT                (0x1U<<12)
#define GPIO_DIRSET_PIN12_SET                   (0x1U<<12)
#define GPIO_DIRSET_PIN11_INPUT                 (0x0U<<11)
#define GPIO_DIRSET_PIN11_OUTPUT                (0x1U<<11)
#define GPIO_DIRSET_PIN11_SET                   (0x1U<<11)
#define GPIO_DIRSET_PIN10_INPUT                 (0x0U<<10)
#define GPIO_DIRSET_PIN10_OUTPUT                (0x1U<<10)
#define GPIO_DIRSET_PIN10_SET                   (0x1U<<10)
#define GPIO_DIRSET_PIN9_INPUT                  (0x0U<<9)
#define GPIO_DIRSET_PIN9_OUTPUT                 (0x1U<<9)
#define GPIO_DIRSET_PIN9_SET                    (0x1U<<9)
#define GPIO_DIRSET_PIN8_INPUT                  (0x0U<<8)
#define GPIO_DIRSET_PIN8_OUTPUT                 (0x1U<<8)
#define GPIO_DIRSET_PIN8_SET                    (0x1U<<8)
#define GPIO_DIRSET_PIN7_INPUT                  (0x0U<<7)
#define GPIO_DIRSET_PIN7_OUTPUT                 (0x1U<<7)
#define GPIO_DIRSET_PIN7_SET                    (0x1U<<7)
#define GPIO_DIRSET_PIN6_INPUT                  (0x0U<<6)
#define GPIO_DIRSET_PIN6_OUTPUT                 (0x1U<<6)
#define GPIO_DIRSET_PIN6_SET                    (0x1U<<6)
#define GPIO_DIRSET_PIN5_INPUT                  (0x0U<<5)
#define GPIO_DIRSET_PIN5_OUTPUT                 (0x1U<<5)
#define GPIO_DIRSET_PIN5_SET                    (0x1U<<5)
#define GPIO_DIRSET_PIN4_INPUT                  (0x0U<<4)
#define GPIO_DIRSET_PIN4_OUTPUT                 (0x1U<<4)
#define GPIO_DIRSET_PIN4_SET                    (0x1U<<4)
#define GPIO_DIRSET_PIN3_INPUT                  (0x0U<<3)
#define GPIO_DIRSET_PIN3_OUTPUT                 (0x1U<<3)
#define GPIO_DIRSET_PIN3_SET                    (0x1U<<3)
#define GPIO_DIRSET_PIN2_INPUT                  (0x0U<<2)
#define GPIO_DIRSET_PIN2_OUTPUT                 (0x1U<<2)
#define GPIO_DIRSET_PIN2_SET                    (0x1U<<2)
#define GPIO_DIRSET_PIN1_INPUT                  (0x0U<<1)
#define GPIO_DIRSET_PIN1_OUTPUT                 (0x1U<<1)
#define GPIO_DIRSET_PIN1_SET                    (0x1U<<1)
#define GPIO_DIRSET_PIN0_INPUT                  (0x0U<<0)
#define GPIO_DIRSET_PIN0_OUTPUT                 (0x1U<<0)
#define GPIO_DIRSET_PIN0_SET                    (0x1U<<0)

// DIRCLR Configuration

