Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_gpio.h
#define GPIO_DIRCLR_PIN31                       (0x1U<<31)
#define GPIO_DIRCLR_PIN30                       (0x1U<<30)
#define GPIO_DIRCLR_PIN29                       (0x1U<<29)
#define GPIO_DIRCLR_PIN28                       (0x1U<<28)
#define GPIO_DIRCLR_PIN27                       (0x1U<<27)
#define GPIO_DIRCLR_PIN26                       (0x1U<<26)
#define GPIO_DIRCLR_PIN25                       (0x1U<<25)
#define GPIO_DIRCLR_PIN24                       (0x1U<<24)
#define GPIO_DIRCLR_PIN23                       (0x1U<<23)
#define GPIO_DIRCLR_PIN22                       (0x1U<<22)
#define GPIO_DIRCLR_PIN21                       (0x1U<<21)
#define GPIO_DIRCLR_PIN20                       (0x1U<<20)
#define GPIO_DIRCLR_PIN19                       (0x1U<<19)
#define GPIO_DIRCLR_PIN18                       (0x1U<<18)
#define GPIO_DIRCLR_PIN17                       (0x1U<<17)
#define GPIO_DIRCLR_PIN16                       (0x1U<<16)
#define GPIO_DIRCLR_PIN15                       (0x1U<<15)
#define GPIO_DIRCLR_PIN14                       (0x1U<<14)
#define GPIO_DIRCLR_PIN13                       (0x1U<<13)
#define GPIO_DIRCLR_PIN12                       (0x1U<<12)
#define GPIO_DIRCLR_PIN11                       (0x1U<<11)
#define GPIO_DIRCLR_PIN10                       (0x1U<<10)
#define GPIO_DIRCLR_PIN9                        (0x1U<<9)
#define GPIO_DIRCLR_PIN8                        (0x1U<<8)
#define GPIO_DIRCLR_PIN7                        (0x1U<<7)
#define GPIO_DIRCLR_PIN6                        (0x1U<<6)
#define GPIO_DIRCLR_PIN5                        (0x1U<<5)
#define GPIO_DIRCLR_PIN4                        (0x1U<<4)
#define GPIO_DIRCLR_PIN3                        (0x1U<<3)
#define GPIO_DIRCLR_PIN2                        (0x1U<<2)
#define GPIO_DIRCLR_PIN1                        (0x1U<<1)
#define GPIO_DIRCLR_PIN0                        (0x1U<<0)
#define GPIO_DIRCLR_PIN31_INPUT                 (0x0U<<31)
#define GPIO_DIRCLR_PIN31_OUTPUT                (0x1U<<31)
#define GPIO_DIRCLR_PIN31_CLEAR                 (0x1U<<31)
#define GPIO_DIRCLR_PIN30_INPUT                 (0x0U<<30)
#define GPIO_DIRCLR_PIN30_OUTPUT                (0x1U<<30)
#define GPIO_DIRCLR_PIN30_CLEAR                 (0x1U<<30)
#define GPIO_DIRCLR_PIN29_INPUT                 (0x0U<<29)
#define GPIO_DIRCLR_PIN29_OUTPUT                (0x1U<<29)
#define GPIO_DIRCLR_PIN29_CLEAR                 (0x1U<<29)
#define GPIO_DIRCLR_PIN28_INPUT                 (0x0U<<28)
#define GPIO_DIRCLR_PIN28_OUTPUT                (0x1U<<28)
#define GPIO_DIRCLR_PIN28_CLEAR                 (0x1U<<28)
#define GPIO_DIRCLR_PIN27_INPUT                 (0x0U<<27)
#define GPIO_DIRCLR_PIN27_OUTPUT                (0x1U<<27)
#define GPIO_DIRCLR_PIN27_CLEAR                 (0x1U<<27)
#define GPIO_DIRCLR_PIN26_INPUT                 (0x0U<<26)
#define GPIO_DIRCLR_PIN26_OUTPUT                (0x1U<<26)
#define GPIO_DIRCLR_PIN26_CLEAR                 (0x1U<<26)
#define GPIO_DIRCLR_PIN25_INPUT                 (0x0U<<25)
#define GPIO_DIRCLR_PIN25_OUTPUT                (0x1U<<25)
#define GPIO_DIRCLR_PIN25_CLEAR                 (0x1U<<25)
#define GPIO_DIRCLR_PIN24_INPUT                 (0x0U<<24)
#define GPIO_DIRCLR_PIN24_OUTPUT                (0x1U<<24)
#define GPIO_DIRCLR_PIN24_CLEAR                 (0x1U<<24)
#define GPIO_DIRCLR_PIN23_INPUT                 (0x0U<<23)
#define GPIO_DIRCLR_PIN23_OUTPUT                (0x1U<<23)
#define GPIO_DIRCLR_PIN23_CLEAR                 (0x1U<<23)
#define GPIO_DIRCLR_PIN22_INPUT                 (0x0U<<22)
#define GPIO_DIRCLR_PIN22_OUTPUT                (0x1U<<22)
#define GPIO_DIRCLR_PIN22_CLEAR                 (0x1U<<22)
#define GPIO_DIRCLR_PIN21_INPUT                 (0x0U<<21)
#define GPIO_DIRCLR_PIN21_OUTPUT                (0x1U<<21)
#define GPIO_DIRCLR_PIN21_CLEAR                 (0x1U<<21)
#define GPIO_DIRCLR_PIN20_INPUT                 (0x0U<<20)
#define GPIO_DIRCLR_PIN20_OUTPUT                (0x1U<<20)
#define GPIO_DIRCLR_PIN20_CLEAR                 (0x1U<<20)
#define GPIO_DIRCLR_PIN19_INPUT                 (0x0U<<19)
#define GPIO_DIRCLR_PIN19_OUTPUT                (0x1U<<19)
#define GPIO_DIRCLR_PIN19_CLEAR                 (0x1U<<19)
#define GPIO_DIRCLR_PIN18_INPUT                 (0x0U<<18)
#define GPIO_DIRCLR_PIN18_OUTPUT                (0x1U<<18)
#define GPIO_DIRCLR_PIN18_CLEAR                 (0x1U<<18)
#define GPIO_DIRCLR_PIN17_INPUT                 (0x0U<<17)
#define GPIO_DIRCLR_PIN17_OUTPUT                (0x1U<<17)
#define GPIO_DIRCLR_PIN17_CLEAR                 (0x1U<<17)
#define GPIO_DIRCLR_PIN16_INPUT                 (0x0U<<16)
#define GPIO_DIRCLR_PIN16_OUTPUT                (0x1U<<16)
#define GPIO_DIRCLR_PIN16_CLEAR                 (0x1U<<16)
#define GPIO_DIRCLR_PIN15_INPUT                 (0x0U<<15)
#define GPIO_DIRCLR_PIN15_OUTPUT                (0x1U<<15)
#define GPIO_DIRCLR_PIN15_CLEAR                 (0x1U<<15)
#define GPIO_DIRCLR_PIN14_INPUT                 (0x0U<<14)
#define GPIO_DIRCLR_PIN14_OUTPUT                (0x1U<<14)
#define GPIO_DIRCLR_PIN14_CLEAR                 (0x1U<<14)
#define GPIO_DIRCLR_PIN13_INPUT                 (0x0U<<13)
#define GPIO_DIRCLR_PIN13_OUTPUT                (0x1U<<13)
#define GPIO_DIRCLR_PIN13_CLEAR                 (0x1U<<13)
#define GPIO_DIRCLR_PIN12_INPUT                 (0x0U<<12)
#define GPIO_DIRCLR_PIN12_OUTPUT                (0x1U<<12)
#define GPIO_DIRCLR_PIN12_CLEAR                 (0x1U<<12)
#define GPIO_DIRCLR_PIN11_INPUT                 (0x0U<<11)
#define GPIO_DIRCLR_PIN11_OUTPUT                (0x1U<<11)
#define GPIO_DIRCLR_PIN11_CLEAR                 (0x1U<<11)
#define GPIO_DIRCLR_PIN10_INPUT                 (0x0U<<10)
#define GPIO_DIRCLR_PIN10_OUTPUT                (0x1U<<10)
#define GPIO_DIRCLR_PIN10_CLEAR                 (0x1U<<10)
#define GPIO_DIRCLR_PIN9_INPUT                  (0x0U<<9)
#define GPIO_DIRCLR_PIN9_OUTPUT                 (0x1U<<9)
#define GPIO_DIRCLR_PIN9_CLEAR                  (0x1U<<9)
#define GPIO_DIRCLR_PIN8_INPUT                  (0x0U<<8)
#define GPIO_DIRCLR_PIN8_OUTPUT                 (0x1U<<8)
#define GPIO_DIRCLR_PIN8_CLEAR                  (0x1U<<8)
#define GPIO_DIRCLR_PIN7_INPUT                  (0x0U<<7)
#define GPIO_DIRCLR_PIN7_OUTPUT                 (0x1U<<7)
#define GPIO_DIRCLR_PIN7_CLEAR                  (0x1U<<7)
#define GPIO_DIRCLR_PIN6_INPUT                  (0x0U<<6)
#define GPIO_DIRCLR_PIN6_OUTPUT                 (0x1U<<6)
#define GPIO_DIRCLR_PIN6_CLEAR                  (0x1U<<6)
#define GPIO_DIRCLR_PIN5_INPUT                  (0x0U<<5)
#define GPIO_DIRCLR_PIN5_OUTPUT                 (0x1U<<5)
#define GPIO_DIRCLR_PIN5_CLEAR                  (0x1U<<5)
#define GPIO_DIRCLR_PIN4_INPUT                  (0x0U<<4)
#define GPIO_DIRCLR_PIN4_OUTPUT                 (0x1U<<4)
#define GPIO_DIRCLR_PIN4_CLEAR                  (0x1U<<4)
#define GPIO_DIRCLR_PIN3_INPUT                  (0x0U<<3)
#define GPIO_DIRCLR_PIN3_OUTPUT                 (0x1U<<3)
#define GPIO_DIRCLR_PIN3_CLEAR                  (0x1U<<3)
#define GPIO_DIRCLR_PIN2_INPUT                  (0x0U<<2)
#define GPIO_DIRCLR_PIN2_OUTPUT                 (0x1U<<2)
#define GPIO_DIRCLR_PIN2_CLEAR                  (0x1U<<2)
#define GPIO_DIRCLR_PIN1_INPUT                  (0x0U<<1)
#define GPIO_DIRCLR_PIN1_OUTPUT                 (0x1U<<1)
#define GPIO_DIRCLR_PIN1_CLEAR                  (0x1U<<1)
#define GPIO_DIRCLR_PIN0_INPUT                  (0x0U<<0)
#define GPIO_DIRCLR_PIN0_OUTPUT                 (0x1U<<0)
#define GPIO_DIRCLR_PIN0_CLEAR                  (0x1U<<0)

