Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_gpio.h
// LATCH Configuration

#define GPIO_LATCH_PIN31                        (0x1U<<31)
#define GPIO_LATCH_PIN30                        (0x1U<<30)
#define GPIO_LATCH_PIN29                        (0x1U<<29)
#define GPIO_LATCH_PIN28                        (0x1U<<28)
#define GPIO_LATCH_PIN27                        (0x1U<<27)
#define GPIO_LATCH_PIN26                        (0x1U<<26)
#define GPIO_LATCH_PIN25                        (0x1U<<25)
#define GPIO_LATCH_PIN24                        (0x1U<<24)
#define GPIO_LATCH_PIN23                        (0x1U<<23)
#define GPIO_LATCH_PIN22                        (0x1U<<22)
#define GPIO_LATCH_PIN21                        (0x1U<<21)
#define GPIO_LATCH_PIN20                        (0x1U<<20)
#define GPIO_LATCH_PIN19                        (0x1U<<19)
#define GPIO_LATCH_PIN18                        (0x1U<<18)
#define GPIO_LATCH_PIN17                        (0x1U<<17)
#define GPIO_LATCH_PIN16                        (0x1U<<16)
#define GPIO_LATCH_PIN15                        (0x1U<<15)
#define GPIO_LATCH_PIN14                        (0x1U<<14)
#define GPIO_LATCH_PIN13                        (0x1U<<13)
#define GPIO_LATCH_PIN12                        (0x1U<<12)
#define GPIO_LATCH_PIN11                        (0x1U<<11)
#define GPIO_LATCH_PIN10                        (0x1U<<10)
#define GPIO_LATCH_PIN9                         (0x1U<<9)
#define GPIO_LATCH_PIN8                         (0x1U<<8)
#define GPIO_LATCH_PIN7                         (0x1U<<7)
#define GPIO_LATCH_PIN6                         (0x1U<<6)
#define GPIO_LATCH_PIN5                         (0x1U<<5)
#define GPIO_LATCH_PIN4                         (0x1U<<4)
#define GPIO_LATCH_PIN3                         (0x1U<<3)
#define GPIO_LATCH_PIN2                         (0x1U<<2)
#define GPIO_LATCH_PIN1                         (0x1U<<1)
#define GPIO_LATCH_PIN0                         (0x1U<<0)
#define GPIO_LATCH_PIN31_NOTLATCHED             (0x0U<<31)
#define GPIO_LATCH_PIN31_LATCHED                (0x1U<<31)
#define GPIO_LATCH_PIN30_NOTLATCHED             (0x0U<<30)
#define GPIO_LATCH_PIN30_LATCHED                (0x1U<<30)
#define GPIO_LATCH_PIN29_NOTLATCHED             (0x0U<<29)
#define GPIO_LATCH_PIN29_LATCHED                (0x1U<<29)
#define GPIO_LATCH_PIN28_NOTLATCHED             (0x0U<<28)
#define GPIO_LATCH_PIN28_LATCHED                (0x1U<<28)
#define GPIO_LATCH_PIN27_NOTLATCHED             (0x0U<<27)
#define GPIO_LATCH_PIN27_LATCHED                (0x1U<<27)
#define GPIO_LATCH_PIN26_NOTLATCHED             (0x0U<<26)
#define GPIO_LATCH_PIN26_LATCHED                (0x1U<<26)
#define GPIO_LATCH_PIN25_NOTLATCHED             (0x0U<<25)
#define GPIO_LATCH_PIN25_LATCHED                (0x1U<<25)
#define GPIO_LATCH_PIN24_NOTLATCHED             (0x0U<<24)
#define GPIO_LATCH_PIN24_LATCHED                (0x1U<<24)
#define GPIO_LATCH_PIN23_NOTLATCHED             (0x0U<<23)
#define GPIO_LATCH_PIN23_LATCHED                (0x1U<<23)
#define GPIO_LATCH_PIN22_NOTLATCHED             (0x0U<<22)
#define GPIO_LATCH_PIN22_LATCHED                (0x1U<<22)
#define GPIO_LATCH_PIN21_NOTLATCHED             (0x0U<<21)
#define GPIO_LATCH_PIN21_LATCHED                (0x1U<<21)
#define GPIO_LATCH_PIN20_NOTLATCHED             (0x0U<<20)
#define GPIO_LATCH_PIN20_LATCHED                (0x1U<<20)
#define GPIO_LATCH_PIN19_NOTLATCHED             (0x0U<<19)
#define GPIO_LATCH_PIN19_LATCHED                (0x1U<<19)
#define GPIO_LATCH_PIN18_NOTLATCHED             (0x0U<<18)
#define GPIO_LATCH_PIN18_LATCHED                (0x1U<<18)
#define GPIO_LATCH_PIN17_NOTLATCHED             (0x0U<<17)
#define GPIO_LATCH_PIN17_LATCHED                (0x1U<<17)
#define GPIO_LATCH_PIN16_NOTLATCHED             (0x0U<<16)
#define GPIO_LATCH_PIN16_LATCHED                (0x1U<<16)
#define GPIO_LATCH_PIN15_NOTLATCHED             (0x0U<<15)
#define GPIO_LATCH_PIN15_LATCHED                (0x1U<<15)
#define GPIO_LATCH_PIN14_NOTLATCHED             (0x0U<<14)
#define GPIO_LATCH_PIN14_LATCHED                (0x1U<<14)
#define GPIO_LATCH_PIN13_NOTLATCHED             (0x0U<<13)
#define GPIO_LATCH_PIN13_LATCHED                (0x1U<<13)
#define GPIO_LATCH_PIN12_NOTLATCHED             (0x0U<<12)
#define GPIO_LATCH_PIN12_LATCHED                (0x1U<<12)
#define GPIO_LATCH_PIN11_NOTLATCHED             (0x0U<<11)
#define GPIO_LATCH_PIN11_LATCHED                (0x1U<<11)
#define GPIO_LATCH_PIN10_NOTLATCHED             (0x0U<<10)
#define GPIO_LATCH_PIN10_LATCHED                (0x1U<<10)
#define GPIO_LATCH_PIN9_NOTLATCHED              (0x0U<<9)
#define GPIO_LATCH_PIN9_LATCHED                 (0x1U<<9)
#define GPIO_LATCH_PIN8_NOTLATCHED              (0x0U<<8)
#define GPIO_LATCH_PIN8_LATCHED                 (0x1U<<8)
#define GPIO_LATCH_PIN7_NOTLATCHED              (0x0U<<7)
#define GPIO_LATCH_PIN7_LATCHED                 (0x1U<<7)
#define GPIO_LATCH_PIN6_NOTLATCHED              (0x0U<<6)
#define GPIO_LATCH_PIN6_LATCHED                 (0x1U<<6)
#define GPIO_LATCH_PIN5_NOTLATCHED              (0x0U<<5)
#define GPIO_LATCH_PIN5_LATCHED                 (0x1U<<5)
#define GPIO_LATCH_PIN4_NOTLATCHED              (0x0U<<4)
#define GPIO_LATCH_PIN4_LATCHED                 (0x1U<<4)
#define GPIO_LATCH_PIN3_NOTLATCHED              (0x0U<<3)
#define GPIO_LATCH_PIN3_LATCHED                 (0x1U<<3)
#define GPIO_LATCH_PIN2_NOTLATCHED              (0x0U<<2)
#define GPIO_LATCH_PIN2_LATCHED                 (0x1U<<2)
#define GPIO_LATCH_PIN1_NOTLATCHED              (0x0U<<1)
#define GPIO_LATCH_PIN1_LATCHED                 (0x1U<<1)
#define GPIO_LATCH_PIN0_NOTLATCHED              (0x0U<<0)
#define GPIO_LATCH_PIN0_LATCHED                 (0x1U<<0)

// DETECTMODE Configuration

#define GPIO_DETECTMODE_DETECTMODE              (0x1U<<0)
#define GPIO_DETECTMODE_DETECTMODE_DEFAULT      (0x0U<<0)
#define GPIO_DETECTMODE_DETECTMODE_LDETECT      (0x1U<<0)

// DETECTMODE_SEC Configuration

#define GPIO_DETECTMODE_SEC_DETECTMODE          (0x1U<<0)
#define GPIO_DETECTMODE_SEC_DETECTMODE_DEFAULT  (0x0U<<0)
#define GPIO_DETECTMODE_SEC_DETECTMODE_LDETECT  (0x1U<<0)

// PIN_CNF Configuration

#define GPIO_PIN_CNF_MCUSEL                     (0x7U<<28)
#define GPIO_PIN_CNF_MCUSEL_0                   (0x1U<<28)
#define GPIO_PIN_CNF_SENSE                      (0x3U<<16)
#define GPIO_PIN_CNF_SENSE_0                    (0x1U<<16)
#define GPIO_PIN_CNF_DRIVE                      (0xFU<<8)
#define GPIO_PIN_CNF_DRIVE_0                    (0x1U<<8)
#define GPIO_PIN_CNF_PULL                       (0x3U<<2)
#define GPIO_PIN_CNF_PULL_0                     (0x1U<<2)
#define GPIO_PIN_CNF_INPUT                      (0x1U<<1)
#define GPIO_PIN_CNF_DIR                        (0x1U<<0)
#define GPIO_PIN_CNF_MCUSEL_APPMCU              (0x0U<<28)
#define GPIO_PIN_CNF_MCUSEL_NETWORKMCU          (0x1U<<28)
#define GPIO_PIN_CNF_MCUSEL_PERIPHERAL          (0x3U<<28)
#define GPIO_PIN_CNF_MCUSEL_TND                 (0x7U<<28)
#define GPIO_PIN_CNF_SENSE_DISABLED             (0x0U<<16)
#define GPIO_PIN_CNF_SENSE_HIGH                 (0x2U<<16)
#define GPIO_PIN_CNF_SENSE_LOW                  (0x3U<<16)
#define GPIO_PIN_CNF_DRIVE_S0S1                 (0x0U<<8)
#define GPIO_PIN_CNF_DRIVE_H0S1                 (0x1U<<8)
#define GPIO_PIN_CNF_DRIVE_S0H1                 (0x2U<<8)
#define GPIO_PIN_CNF_DRIVE_H0H1                 (0x3U<<8)
#define GPIO_PIN_CNF_DRIVE_D0S1                 (0x4U<<8)
#define GPIO_PIN_CNF_DRIVE_D0H1                 (0x5U<<8)
#define GPIO_PIN_CNF_DRIVE_S0D1                 (0x6U<<8)
#define GPIO_PIN_CNF_DRIVE_H0D1                 (0x7U<<8)
#define GPIO_PIN_CNF_DRIVE_E0E1                 (0xBU<<8)
#define GPIO_PIN_CNF_PULL_DISABLED              (0x0U<<2)
#define GPIO_PIN_CNF_PULL_PULLDOWN              (0x1U<<2)
#define GPIO_PIN_CNF_PULL_PULLUP                (0x3U<<2)
#define GPIO_PIN_CNF_INPUT_CONNECT              (0x0U<<1)
#define GPIO_PIN_CNF_INPUT_DISCONNECT           (0x1U<<1)
#define GPIO_PIN_CNF_DIR_INPUT                  (0x0U<<0)
#define GPIO_PIN_CNF_DIR_OUTPUT                 (0x1U<<0)
